app/Http/Controllers/Admin/Api/Products/ApiCreateProductController.php

select * from `attribute_values` where `attribute_values`.`attribute_id` in (2) and `is_active` = 1
select * from `attributes` where `id` = '2' and `is_active` = 1 limit 1
---
    public function addAttribute(Request $request)
    {
        $attribute = Attribute::query()->where('id', request('attribute_id'))->with(['attributeValues' => function ($q) {
            $q->where('is_active', '=', 1);
        }])->first();

select * from `attribute_values` where `attribute_values`.`attribute_id` in (2) and `id` in ('4', '5', '6')
select * from `attributes` where `id` in ('2')
---
    public function addAttributeValue(Request $request)
    {
        $attributeValueIds = request()->input('attributeValueIds');
        $attributeIds = request()->input('attributeIds');

        $attributes = Attribute::query()->whereIn('id', $attributeIds)->with(['attributeValues' => function ($query) use ($attributeValueIds) {
            $query->whereIn('id', $attributeValueIds);
        }])->get();