app/Http/Controllers/Client/CartController.php

    public function store(Request $request)
    {
        $product = Product::where('id', $request->product_id)->with('variants')->first();

        if ($product->variants->count() > 0) {
            $attributeID = request('attribute');

            if ($attributeID){
                $variant = Variant::where('product_id', '=', $request->product_id)
                    ->whereHas('attributeValues', function ($query) use ($attributeID) {
                        $query->whereIn('attribute_values.id', $attributeID);
                    }, '=', count($attributeID))
                    ->withCount('attributeValues')
                    ->having('attribute_values_count', '=', count($attributeID))
                    ->first();
---
select `attribute_values`.*, `attribute_value_variant`.`variant_id` as `pivot_variant_id`, `attribute_value_variant`.`attribute_value_id` as `pivot_attribute_value_id` from `attribute_values` inner join `attribute_value_variant` on `attribute_values`.`id` = `attribute_value_variant`.`attribute_value_id` where `attribute_value_variant`.`variant_id` in (1)
select * from `products` where `products`.`id` = '9' limit 1
select * from `variants` where `variants`.`product_id` in (9)


        $cart = Cart::where('user_id', \Auth::id());

        if ($cart->exists()) {
---
select * from `carts` where `user_id` = 2 limit 1

            if ($cartItem->exists()){
                $cartItem->update(['quantity' => intval($cartItem->first()->quantity) + intval($data['quantity'])]);
            }else{
                CartItem::create($data);
---
insert into `cart_items` (`cart_id`, `product_id`, `variant_id`, `quantity`, `updated_at`, `created_at`) values (2, '9', 1, '1', '2024-11-09 14:17:52', '2024-11-09 14:17:52')