app/Http/Controllers/Client/CheckoutController.php

update `orders` set `payment_status` = 1, `orders`.`updated_at` = '2024-11-09 14:22:12' where `id` = '45'
---
    public function vnPayReturn(Request $request)
    {

        if ($request->vnp_ResponseCode == '00') {
            Order::query()->where('id', $request->vnp_TxnRef)->update([
                'payment_status' => 'Đã thanh toán',
            ]);
        } else {
            Order::query()->where('id', $request->vnp_TxnRef)->update([
                'payment_status' => 'Chưa thanh toán',
            ]);