app/Http/Controllers/Client/HomeController.php

    public function index(){
        $products = Product::query()
            ->where('is_active', '=',1)
            ->where('is_home', '=', 1)
            ->with('categories', 'variants')
            ->get();
---
select * from `variants` where `variants`.`product_id` in (2, 3, 4, 5, 6, 7, 8, 9, 14, 15, 16)
select * from `products` where `is_active` = 1 and `is_home` = 1
select `categories`.*, `product_category`.`product_id` as `pivot_product_id`, `product_category`.`category_id` as `pivot_category_id` from `categories` inner join `product_category` on `categories`.`id` = `product_category`.`category_id` where `product_category`.`product_id` in (21, 22, 23, 24, 25, 26, 30, 32, 34, 35, 37, 39, 40, 42)