app/Http/Controllers/Client/ProductController.php

select * from `attribute_values` where `attribute_values`.`attribute_id` in (1, 2, 3)
select * from `products` where `slug` = 'cum-beatae-aut-impedit-optio-qui' limit 1
select * from `variants` where `variants`.`product_id` in (2)
select `categories`.*, `product_category`.`product_id` as `pivot_product_id`, `product_category`.`category_id` as `pivot_category_id` from `categories` inner join `product_category` on `categories`.`id` = `product_category`.`category_id` where `product_category`.`product_id` in (2)
select * from `products` where `id` != 30 and `brand_id` = 3 and `is_active` = 1 order by `created_at` desc limit 8
---
    public function productDetail(Request $request)
    {
        $product = Product::query()
            ->with('attributes.attributeValues')
            ->with('attributeValues')
            ->with('variants.attributeValues')
            ->with('categories')
            ->where('slug', $request->slug)
            ->first();

        $relatedProducts = '';

        if ($product->categories->isEmpty() && $product->brand_id == null){
            $relatedProducts = Product::query()
                ->where('id', '!=', $product->id)
                ->where('is_active', '=', 1)
                ->latest()
                ->limit(8)
                ->get();
        }elseif ($product->categories->isEmpty() && $product->brand_id != null){
            $relatedProducts = Product::query()
                ->where('id', '!=', $product->id)
                ->where('brand_id', $product->brand_id)
                ->where('is_active', '=', 1)
                ->latest()
                ->limit(8)
                ->get();