app/Http/Controllers/Client/ShopController.php

    public function index(Request $request)
    {
        $products = Product::where('is_active', '=', 1)
            ->with(['categories', 'variants'])
            ->paginate(12);
        $categories = Category::where('is_active', '=', 1)
            ->whereNull('parent_id')
            ->withCount('products')
            ->orderBy('name', 'ASC')
            ->get();
        $brands = Brand::where('is_active', '=', 1)
            ->withCount('products')
            ->orderBy('name', 'ASC')
            ->get();
---
select * from `products` where `is_active` = 1 order by `created_at` desc limit 12 offset 0
select * from `variants` where `variants`.`product_id` in (2, 3, 4, 5, 6, 7, 8, 9, 14, 15, 16)
select count(*) as aggregate from `products` where `is_active` = 1
select * from `categories` where `is_active` = 1 order by `name` asc
select `products`.*, `product_category`.`category_id` as `pivot_category_id`, `product_category`.`product_id` as `pivot_product_id` from `products` inner join `product_category` on `products`.`id` = `product_category`.`product_id` where `product_category`.`category_id` in (1, 2, 3, 4)
select * from `brands` where `is_active` = 1 order by `name` asc