app/Providers/AppServiceProvider.php

    public function boot(): void
    {
        Paginator::useBootstrap();

        view()->composer('client.layouts.main-nav',function ($view){
            $categories = Category::query()->whereNull('parent_id')->where('is_active', '=', 1)->with(['children' => function ($q) {
                $q->where('is_active', '=', 1)->orderBy('name', 'ASC');
            }])->orderBy('name', 'ASC')->get();

            $view->with(compact('categories'));
        });
---
select * from `categories` where `categories`.`parent_id` in (1, 2, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14) and `is_active` = 1 order by `name` asc
select * from `categories` where `categories`.`parent_id` in (3, 4, 6) and `is_active` = 1 order by `name` asc