app/Http/Controllers/Admin/AttributeController.php

select * from `attribute_values` where `attribute_values`.`attribute_id` in (1, 2, 3)
select * from `attributes`
---
    public function index()
    {
        $attributes = Attribute::query()->with('attributeValues')->latest()->get();

select * from `attribute_values` where `attribute_values`.`attribute_id` in (2)
select * from `attributes` where `attributes`.`id` = '2' limit 1
---
    public function edit(string $id)
    {
        $attribute = Attribute::query()->with('attributeValues')->findOrFail($id);