app/Http/Controllers/Admin/CategoryController.php

select * from `categories` where `categories`.`parent_id` in (1, 2, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14) order by `name` asc
---
    public function index()
    {
        $categories = Category::query()
            ->whereNull('parent_id')->with(['children' => function ($q) {
            $q->orderBy('name', 'ASC');
        }])
            ->with('products')
            ->latest()
            ->orderBy('name', 'ASC')
            ->get();