app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {
        $categories = Category::query()->whereNull('parent_id')->with(['children', 'products'])->latest()->get();
---
select * from `categories` where `parent_id` is null order by `created_at` desc
select `products`.*, `product_category`.`category_id` as `pivot_category_id`, `product_category`.`product_id` as `pivot_product_id` from `products` inner join `product_category` on `products`.`id` = `product_category`.`product_id` where `product_category`.`category_id` in (3, 4, 6)

    public function create()
    {
        $categories = Category::query()->whereNull('parent_id')->with('children')->get();
---
select * from `categories` where `parent_id` is null order by `created_at` desc

    public function store(Request $request)
    {
        $data = [
            'name' => request('name'),
            'parent_id' => request('parent_id'),
            'description' => request('description'),
            'is_active' => request('is_active'),
        ];
        $data['slug'] = Str::slug($data['name']);
        if (request()->hasFile('image')) {
            $data['image'] = Storage::put(self::PATH_UPLOAD, request()->file('image'));
        }
        $data['image'] ??= null;

        try {
            $category = Category::query()->create($data);
---
insert into `categories` (`name`, `parent_id`, `description`, `is_active`, `slug`, `image`, `updated_at`, `created_at`) values ('chuhoainam', null, null, '1', 'chuhoainam', null, '2024-11-09 13:50:42', '2024-11-09 13:50:42')

    public function edit(Category $category)
    {
        $categories = Category::query()->whereNull('parent_id')->with('children')->get();
---
select * from `categories` where `categories`.`parent_id` in (1, 2, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14)