app/Http/Controllers/Admin/OrderController.php

select * from `order_items` where `order_items`.`order_id` in (36, 37, 38, 39, 40, 41, 42, 43, 44, 45)
select * from `orders` order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (2)
select count(*) as aggregate from `orders`
---
    public function index()
    {
        $orders = Order::query()->with([
            'user',
            'orderItems'
        ])->latest()->paginate(10);