app/Http/Controllers/Admin/ProductController.php

    public function edit(Product $product)
    {
        $attributes = Attribute::query()->pluck('name', 'id');
        $tags = Tag::query()->pluck('name', 'id');
        $brands = Brand::query()->pluck('name', 'id');
        $categories = Category::query()->whereNull('parent_id')->with('children')->get();
        $product->load([
            'categories',
            'tags',
        ]);
---
select `name`, `id` from `attributes`
select `name`, `id` from `tags`
select `name`, `id` from `brands`
select * from `categories` where `categories`.`parent_id` in (3, 4)
select `categories`.*, `product_category`.`product_id` as `pivot_product_id`, `product_category`.`category_id` as `pivot_category_id` from `categories` inner join `product_category` on `categories`.`id` = `product_category`.`category_id` where `product_category`.`product_id` in (16)
select `tags`.*, `product_tag`.`product_id` as `pivot_product_id`, `product_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `product_tag` on `tags`.`id` = `product_tag`.`tag_id` where `product_tag`.`product_id` in (16)