app/Http/Controllers/Admin/ProductController.php

select * from `brands` where `brands`.`id` in (2, 3, 4, 5)
select * from `products` order by `created_at` desc limit 10 offset 0
select `categories`.*, `product_category`.`product_id` as `pivot_product_id`, `product_category`.`category_id` as `pivot_category_id` from `categories` inner join `product_category` on `categories`.`id` = `product_category`.`category_id` where `product_category`.`product_id` in (21, 22, 23, 24, 25, 26, 27, 28, 29, 42)
select count(*) as aggregate from `products`
---
    public function index()
    {
        $products = Product::query()->with('categories', 'brand', 'reviews', 'variants')->paginate(10);

select `name`, `id` from `attributes` where `is_active` = 1 order by `name` asc
select `name`, `id` from `tags` where `is_active` = 1 order by `name` asc
select `name`, `id` from `brands` where `is_active` = 1 order by `name` asc
select * from `categories` where `categories`.`parent_id` in (1, 2, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14) and `is_active` = 1 order by `name` asc
---
    public function create()
    {
        $attributes = Attribute::query()
            ->where('is_active', '=', 1)
            ->orderBy('name', 'ASC')
            ->pluck('name', 'id');

        $tags = Tag::query()
            ->where('is_active', '=', 1)
            ->orderBy('name', 'ASC')
            ->pluck('name', 'id');

        $brands = Brand::query()
            ->where('is_active', '=', 1)
            ->orderBy('name', 'ASC')
            ->pluck('name', 'id');

        $categories = Category::query()
            ->whereNull('parent_id')
            ->where('is_active', '=', 1)
            ->with(['children' => function ($q) {
                $q->where('is_active', '=', 1)->orderBy('name', 'ASC');
            }])
            ->orderBy('name', 'ASC')
            ->get();

insert into `products` (`name`, `sku`, `price`, `price_sale`, `quantity`, `description`, `short_desc`, `brand_id`, `is_active`, `is_featured`, `is_new`, `is_sale`, `is_hot`, `is_home`, `image`, `slug`, `updated_at`, `created_at`) values ('chuhoainam', 'GLcTpXrq', 0, 0, 0, null, null, null, '1', 0, 0, 0, 0, '1', null, 'chuhoainam-GLcTpXrq', '2024-11-14 19:23:10', '2024-11-14 19:23:10')
---

            try {

                $product = Product::query()->create($data);

insert into `variants` (`sku`, `quantity`, `price`, `price_sale`, `product_id`, `image`, `slug`, `updated_at`, `created_at`) values ('hyuh2hfN', null, null, null, 42, null, 'chuhoainam-hyuh2hfN', '2024-11-14 19:23:10', '2024-11-14 19:23:10')
insert into `variant_attribute_values` (`attribute_value_id`, `variant_id`) values ('4', 1), ('7', 1)
---
                    if ($dataVariant['image']) {
                        $dataVariant['image'] = Storage::put(self::PATH_UPLOAD, $dataVariant['image']);
                    }
                    $productVariant = Variant::query()->create($dataVariant);
                    $productVariant->attributeValues()->attach($valueIds);

select * from `products` limit 1
---

            } catch (\Exception $exception) {
                DB::rollBack();
                return redirect()->route('admin.products.create')->with('error', $exception->getMessage());

update `products` set `price` = 0, `price_sale` = 0, `is_hot` = '1', `is_sale` = '1', `is_new` = '1', `products`.`updated_at` = '2024-11-14 19:49:58' where `id` = 42
---
            $galleries = request('galleries');

            try {
                $product->update($data);