app/Http/Controllers/Admin/TagController.php

select * from `tags` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `tags`
---
    public function index()
    {
        $tags = Tag::query()->latest()->paginate(10);